import sqlite3

# Підключення до бази даних
conn = sqlite3.connect('equipment.db')

# Створення курсора
cursor = conn.cursor()

cursor.execute('''
    INSERT INTO Equipment (name, price) VALUES
    ('Кран', 900),
    ('Самоскид', 800),
    ('Бетономішалка', 1000),
    ('Бетононасос', 800),
    ('Бульдозер', 1000),
    ('Вантажопідйомник', 1000),
    ('Віброплита', 500),
    ('Екскаватор', 700),
    ('Самоходна вишка', 800);
''')

cursor.execute('''
    INSERT INTO SensorCategory (category) VALUES
    ('Показники стану та робочих параметрів двигуна'),
    ('Показники з механічних частин будівельної техніки');
''')

cursor.execute('''
    INSERT INTO Sensor (sensor_category, sensor_name, max_value, min_value) VALUES
    (1, 'Датчик детонації', 110, 93),
    (1, 'Датчик температури охолоджуючої рідини', 100, 75),
    (1, 'Датчик температури моторного масла', 120, 85),
    (1, 'Датчик рівня палива', 200, 10),
    (2, 'Тензодатчик', 380, 0),
    (2, 'Інклінометр', 30, -30),
    (2, 'Датчик наближення', 30, 2),
    (2, 'Датчик тиску шин', 33, 27);
''')

# Збереження змін
conn.commit()
# Закриття з'єднання
conn.close()